Revit 2026 API

# PostPattern Class

---

Post pattern class.

SystemObject Autodesk.Revit.DB.ArchitecturePostPattern

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PostPattern : IDisposable
```
```vb
Public Class PostPattern
	Implements IDisposable
```
```cpp
public ref class PostPattern : IDisposable
```
```fsharp
type PostPattern =
    class
        interface IDisposable
    end
```

The PostPattern type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CornerPost | Accesses the object containing properties related to the corner post. |
|  | CornerPostAngle | The angle between neighboring railing segments which conditions inserting post along a railing path. |
|  | CornerPostCondition | The condition which controls the insertion of corner posts. |
|  | EndPost | Accesses the object containing properties related to the end post. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | StartPost | Accesses the object containing properties related to the start post. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the PostPattern |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Architecture Namespace